environments/cfd/rand_env_4/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

23
(
    auto0
    {
        type            wall;
        nFaces          3233;
        startFace       228133;
    }
    auto1
    {
        type            wall;
        nFaces          1701;
        startFace       231366;
    }
    auto2
    {
        type            wall;
        nFaces          3013;
        startFace       233067;
    }
    auto3
    {
        type            wall;
        nFaces          1872;
        startFace       236080;
    }
    auto4
    {
        type            wall;
        nFaces          7437;
        startFace       237952;
    }
    auto5
    {
        type            wall;
        nFaces          4126;
        startFace       245389;
    }
    auto6
    {
        type            wall;
        nFaces          6531;
        startFace       249515;
    }
    auto7
    {
        type            wall;
        nFaces          1541;
        startFace       256046;
    }
    auto8
    {
        type            wall;
        nFaces          240;
        startFace       257587;
    }
    auto9
    {
        type            wall;
        nFaces          4979;
        startFace       257827;
    }
    auto10
    {
        type            wall;
        nFaces          2414;
        startFace       262806;
    }
    auto11
    {
        type            wall;
        nFaces          2785;
        startFace       265220;
    }
    auto12
    {
        type            wall;
        nFaces          1148;
        startFace       268005;
    }
    auto13
    {
        type            wall;
        nFaces          1181;
        startFace       269153;
    }
    auto14
    {
        type            wall;
        nFaces          995;
        startFace       270334;
    }
    auto15
    {
        type            wall;
        nFaces          1175;
        startFace       271329;
    }
    auto16
    {
        type            wall;
        nFaces          665;
        startFace       272504;
    }
    auto17
    {
        type            wall;
        nFaces          240;
        startFace       273169;
    }
    auto18
    {
        type            wall;
        nFaces          3;
        startFace       273409;
    }
    auto19
    {
        type            wall;
        nFaces          709;
        startFace       273412;
    }
    auto20
    {
        type            wall;
        nFaces          1402;
        startFace       274121;
    }
    auto21
    {
        type            wall;
        nFaces          1318;
        startFace       275523;
    }
    auto22
    {
        type            wall;
        nFaces          240;
        startFace       276841;
    }
)

// ************************************************************************* //
