environments/cfd/rand_env_4/0/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 location "0";
 object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (0 0 0);

boundaryField
{
  auto0
  {
    type zeroGradient;
  }
  auto1
  {
    type noSlip;
  }
  auto2
  {
    type noSlip;
  }
  auto3
  {
    type noSlip;
  }
  auto4
  {
    type noSlip;
  }
  auto5
  {
    refValue uniform -1 ;
    type surfaceNormalFixedValue;
  }
  auto6
  {
    type noSlip;
  }
  auto7
  {
    type noSlip;
  }
  auto8
  {
    type noSlip;
  }
  auto9
  {
    type noSlip;
  }
  auto10
  {
    type noSlip;
  }
  auto11
  {
    type noSlip;
  }
  auto12
  {
    type noSlip;
  }
  auto13
  {
    type noSlip;
  }
  auto14
  {
    type noSlip;
  }
  auto15
  {
    type noSlip;
  }
  auto16
  {
    type noSlip;
  }
  auto17
  {
    type noSlip;
  }
  auto18
  {
    type noSlip;
  }
  auto19
  {
    type noSlip;
  }
  auto20
  {
    type noSlip;
  }
  auto21
  {
    type noSlip;
  }
  auto22
  {
    type noSlip;
  }
} 	// ************************************************************************* //

